performance/PayrollClockOutLoadTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  SCAFFOLD / TEMPLATE - Load & Performance Testing.

  Simulates ~50,000 employees clocking out concurrently at end-of-shift /
  end-of-month, to check whether the time-clock/payroll backend or its
  database falls over under that burst load.

  There is no real staging server for this project to point at yet, so
  HTTP Request Defaults below targets a placeholder host
  ("api.orangehrm-payroll-engine.local") purely to keep the plan concrete
  and runnable once a real target exists. This file is NOT wired into the
  Maven build - JMeter runs standalone, outside `mvn test`.

  How to run once you have a real target:
    1. Install JMeter (https://jmeter.apache.org/) or use the Docker image.
    2. Edit "HTTP Request Defaults" below: server name/IP, port, protocol.
    3. Non-GUI run (recommended for real load, not the GUI):
         jmeter -n -t performance/PayrollClockOutLoadTest.jmx \
                -l performance/results/clockout-results.jtl \
                -e -o performance/results/html-report
    4. Inspect the generated HTML report for throughput, error %, and
       response-time percentiles under load.

  Tune "ThreadGroup.num_threads" / "ThreadGroup.ramp_time" to match the
  real scenario you're modeling (e.g. 50000 threads ramped over 300s to
  emulate a mass end-of-shift clock-out rather than an instant spike).
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Payroll Clock-Out Load Test" enabled="true">
      <stringProp name="TestPlan.comments">Mass end-of-shift clock-out load simulation. See file header for setup notes.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <stringProp name="HTTPSampler.domain">api.orangehrm-payroll-engine.local</stringProp>
        <stringProp name="HTTPSampler.port">443</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="End-of-Shift Clock-Out Burst" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">300</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/timeclock/punch (clock-out)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{ "employeeId": "EMP-${__threadNum}", "punchType": "CLOCK_OUT", "timestamp": "${__time(yyyy-MM-dd'T'HH:mm:ss)}" }</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/v1/timeclock/punch</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code = 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">performance/results/clockout-results.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>